multiple_user.yml
config:
  target: https://api-test.gms-ua.work
  engines:
    playwright:
      trace: true
  http:
    timeout: 30
  phases:
    - duration: 60
      arrivalRate: 5
      name: Static
    #- duration: 60
    #  arrivalRate: 1
    #  rampTo: 5
   #   name: Warm up phase
    #- duration: 60
    #  arrivalRate: 5
    #  rampTo: 10
    #  name: Ramp up load
    # - duration: 30
    #  arrivalRate: 10
   #   rampTo: 30
   #   name: Spike phase
  plugins:
    ensure: {}
    apdex: {
    }
    metrics-by-endpoint: {}
    expect: {}
  apdex:
    threshold: 1000
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
  processor: "./index.js"

before:
  flow:
    - loop:
      - post:
          url: '/api/v1/users/signin'
          beforeRequest: "generateUser"
          afterResponse: "storeToken"
          json:
            username: "%username%"
            password: "%password%"
          capture:
            - json: $.access_token
              as: token
      count: 10

scenarios:
  - name: 'Покупка товара'
    beforeScenario: 'selectRandomToken'
    flow:
      - loop:
          - post:
              url: '/api/v1/cheque/new'
              headers: 
                authorization: 'Bearer {{token}}'
              json: {}
              capture:
                - json: $.id
                  as: guid                             
          - post:
              url: '/api/v1/cheque/{{guid}}/prod_add'
              headers: 
                authorization: 'Bearer {{token}}'
              json: 
                gty: 1.0
                prod_id: 1
          - post:
              url: '/api/v1/cheque/{{guid}}/close'
              headers: 
                authorization: 'Bearer {{token}}'
              json:
                round_cheque_sum: 110
                payments: 
                    -id: 1
                    sum: 110
                    pay_form: "cash"
        count: 1